erdemerciyas/ESP32-S3-OBD2/esp32-obd2-monitor/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Waveshare ESP32-S3-Touch-LCD-2.1: 8MB OPI PSRAM, 16MB flash
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# dashboard_init + LVGL on main needs extra stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# RGB LCD framebuffer in PSRAM
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# LVGL Montserrat fonts used by dashboard UI
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# LVGL render cadence — lighter draw path (no debug overlay)
CONFIG_LV_DEF_REFR_PERIOD=16
CONFIG_LV_DRAW_SW_SHADOW_CACHE_SIZE=0
CONFIG_LV_OBJ_STYLE_CACHE=y
CONFIG_LV_USE_SYSMON=n
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_MEM_SIZE_KILOBYTES=128

# Bluetooth LE (NimBLE) — OBD via BLE ELM327 adapter
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=12288
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=247
CONFIG_BT_NIMBLE_SCAN_DUPLICATE=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
# BLE/NimBLE on CPU0 (controller heap); LVGL on CPU1
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y
CONFIG_BT_NIMBLE_PINNED_TO_CORE=0
CONFIG_BT_CTRL_PINNED_TO_CORE_0=y
CONFIG_BT_CTRL_PINNED_TO_CORE=0

# BLE scan + I2C touch can defer ISRs — relax INT WDT on CPU0 only
CONFIG_ESP_INT_WDT_TIMEOUT_MS=1300
# CONFIG_ESP_INT_WDT_CHECK_CPU1 is not set

# Disable CPU1 idle WDT check during long BLE connect
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
# CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1 is not set
